In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.1-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.1-cp313-cp313-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   -- ------------------------------------- 0.8/11.0 MB 5.4 MB/s eta 0:00:02
   ------ --------------------------------- 1.8/11.0 MB 4.7 MB/s eta 0:00:02
   ---------- ----------------------------- 2.9/11.0 MB 4.5 MB/s eta 0:00:02
   ------------- -------------------------- 3.7/11.0 MB 4.5 MB/s eta 0:00:02
   ---------------- ----------------------- 4.5/11.0 MB 4.2 MB/s eta 0:00:02
   -------------------- ------------------- 5.5/11.0 MB 4.3 MB/s eta 0:00:02
   ----------------------- ---------------- 6.6/11.0 MB 4.4 MB/s eta 0:00:02
   -------------------------- ------------- 7.3/11.0 MB 4.4 MB/s eta 0:00:01
   ------------------------------ --------- 8.4/11.0 MB 4.3 MB/s eta 0:00:01
   --------------------------------- ------ 9.2/11.0 MB 4.3 MB/s eta 0:00:01
   ------------------------------------ --- 10.0/11.0 MB 4.3 MB/s eta 0:00:01
   ---------------------------------------  10.7/11.0 MB 4.3 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 4.2 MB/s eta 0:00:00
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.3.1 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [ ]:
import pandas as pd
import numpy as np
seri = pd.Series([1,2,3,4,5,6,7,8,9])
print(seri)
type(seri)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

pandas.core.series.Series

In [3]:
print(seri.axes)

[RangeIndex(start=0, stop=9, step=1)]

In [7]:
print(seri.size)
print(seri.ndim)

9
1

In [8]:
print(seri.values)

[1 2 3 4 5 6 7 8 9]

In [11]:
seri.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
print(seri.head(3))
# eğer head içine değer yazarsak o kadar değeri döndürür

0    1
1    2
2    3
dtype: int64

In [13]:
seri.tail()

4    5
5    6
6    7
7    8
8    9
dtype: int64

In [14]:
print(seri.tail(3))

6    7
7    8
8    9
dtype: int64

In [8]:
import pandas as pd
seri1 = pd.Series([99,22,332,94,5], index = ["a","b","c","d","e"])
print(seri1)

a     99
b     22
c    332
d     94
e      5
dtype: int64

In [9]:
print(seri1["a"]) # bu işlem a değerini döndürür

99

In [10]:
print(seri1["a" : "c"]) # bu işlem a'dan c'ye kadar olan değerleri döndürür

a     99
b     22
c    332
dtype: int64

In [ ]:
sozluk = {"reg": 10, "log": 11, "card": 12} # sözlük oluşturma
seri2 = pd.Series(sozluk) # sözlükten seri oluşturma
print(seri2)

reg     10
log     11
card    12
dtype: int64

In [ ]:
import numpy as np
import pandas as pd
randomNumbers = np.random.randint(10,100,5) # 10 ile 100 arasında 5 adet rastgele sayı üretir
pandas = pd.Series(randomNumbers) # pandas serisi oluşturur
print(pandas) 
print(pandas[0])

0    32
1    32
2    78
3    45
4    16
dtype: int32
32

In [16]:
seri3 = pd.Series([200,121,150,99], index = ["a","b","c","d"])
print(seri3)

a    200
b    121
c    150
d     99
dtype: int64

In [ ]:
seri3.index #serinin index değerlerini döndürür

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
seri3.keys() #index ile aynı işlemi yapar

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
print(list(seri3.items())) #serinin index ve değerlerini döndürür

[('a', 200), ('b', 121), ('c', 150), ('d', 99)]

In [24]:
"a" in seri3 # a değeri serinin içinde mi?

True

In [27]:
seri3[["a","b"]] #a ve b değerlerini döndürür

a    200
b    121
dtype: int64

In [28]:
seri3["a"] = 250 # a değerini 250 olarak günceller
print(seri3)

a    250
b    121
c    150
d     99
dtype: int64

In [29]:
l = [1,2,3,4,5]
pd.DataFrame(l, columns=["degisken_ismi"]) # DataFrame oluşturma

   degisken_ismi
0              1
1              2
2              3
3              4
4              5

In [ ]:
n = np.arange(1,10).reshape((3,3)) # 1'den 10'a kadar olan sayıları 3x3'lük bir matris olarak oluşturur
pd.DataFrame(n, columns=["1","2","3"])

   1  2  3
0  1  2  3
1  4  5  6
2  7  8  9

In [32]:
df = pd.DataFrame(n, columns=["var1","var2","var3"])
df.head(2) # DataFrame'in ilk 2 satırını döndürür

   var1  var2  var3
0     1     2     3
1     4     5     6

In [33]:
df.columns= {"degisken1","degisken2","degisken3"} # DataFrame'in kolon isimlerini değiştirir
df

   degisken2  degisken1  degisken3
0          1          2          3
1          4          5          6
2          7          8          9

In [34]:
df.axes # DataFrame'in eksenlerini döndürür

[RangeIndex(start=0, stop=3, step=1),
 Index(['degisken2', 'degisken1', 'degisken3'], dtype='object')]

In [35]:
df.shape # DataFrame'in boyutlarını döndürür

(3, 3)

In [36]:
df.ndim # DataFrame'in boyut sayısını döndürür

2

In [37]:
df.size # DataFrame'in eleman sayısını döndürür

9

In [38]:
df.values # DataFrame'in değerlerini döndürür

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [39]:
df.tail(1) # DataFrame'in son bir satırını döndürür

   degisken2  degisken1  degisken3
2          7          8          9

In [40]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [46]:
sozluk = {"degisken1": s1, "degisken2": s2, "degisken3": s3}
df = pd.DataFrame(sozluk)
df

   degisken1  degisken2  degisken3
0          5          8          8
1          4          6          6
2          2          5          3
3          2          2          0
4          1          6          0

In [47]:
df[0:1] # DataFrame'in ilk satırını döndürür

   degisken1  degisken2  degisken3
0          5          8          8

In [70]:
df.index = ["c","d","e"] # DataFrame'in index değerlerini değiştirir
df

   degisken1  degisken2  degisken3
c          2          5          3
d          2          2          0
e          1          6          0

In [72]:
df["d" : "e"] # DataFrame'in c'den e'ye kadar olan satırlarını döndürür

   degisken1  degisken2  degisken3
d          2          2          0
e          1          6          0

In [73]:
df.drop("c", axis=0) # DataFrame'den b satırını siler
# geçici olarak siler, kalıcı olarak silmek için inplace=True parametresini kullanabilirsiniz

   degisken1  degisken2  degisken3
d          2          2          0
e          1          6          0

In [74]:
df

   degisken1  degisken2  degisken3
c          2          5          3
d          2          2          0
e          1          6          0

In [75]:
df.drop("c", axis=0, inplace=True) # DataFrame'den c satırını kalıcı olarak siler

In [76]:
df

   degisken1  degisken2  degisken3
d          2          2          0
e          1          6          0

In [81]:
l = ["degisken1", "degisken2", "degisken3"] 
for i in l: # döngü ile liste elemanlarını kontrol eder
    print(i in l)

True
True
True

In [ ]:
df["degisken4"] = df["degisken1"] / df["degisken2"] # yeni bir sütun ekler ve var1'in var2'ye bölümü ile doldurur
df

   degisken1  degisken2  degisken3  degisken4
d          2          2          0   1.000000
e          1          6          0   0.166667

In [84]:
df.drop("degisken4", axis=1, inplace=True) # degisken4 sütununu DataFrame'den kalıcı olarak siler
df

   degisken1  degisken2  degisken3
d          2          2          0
e          1          6          0

In [85]:
l = ["degisken1", "degisken2"]
df.drop(l,axis=1) # degisken1 ve degisken2 sütunlarını DataFrame'den siler

   degisken3
d          0
e          0

In [ ]:
m = np.random.randint(1,30, size = (10,3)) # rastgele 10 satır ve 3 sütunlu bir matris oluşturur
df = pd.DataFrame(m, columns=["var1", "var2", "var3"]) # DataFrame oluşturur
df

   var1  var2  var3
0    29    14    17
1     3    28    19
2    22    16     3
3    28     2    27
4    21    19     2
5     4    24    26
6    12    29    18
7    23    26    17
8     7     8     8
9    23    18    17

In [90]:
df.loc[0:3] # DataFrame'in 0'dan 3'e kadar olan satırlarını döndürür

   var1  var2  var3
0    29    14    17
1     3    28    19
2    22    16     3
3    28     2    27

In [91]:
df.iloc[0:3] # DataFrame'in 0'dan 3'e kadar olan satırlarını döndürür, iloc sayısal indeksleme yapar

   var1  var2  var3
0    29    14    17
1     3    28    19
2    22    16     3

In [ ]:
df.iloc[0:0] # DataFrame'in 0'dan 0'a kadar olan satırlarını döndürür, yani boş bir DataFrame döndürür

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [93]:
df.iloc[:3 , :3] # DataFrame'in ilk 3 satırını ve ilk 3 sütununu döndürür

   var1  var2  var3
0    29    14    17
1     3    28    19
2    22    16     3

In [96]:
df.loc[0:3,"var3"] # DataFrame'in 0'dan 3'e kadar olan satırlarının var3 sütununu döndürür

0    17
1    19
2     3
3    27
Name: var3, dtype: int32

In [ ]:
df.iloc[0:3, 0:2] 
#DataFrame'in 0'dan 3'e kadar olan satırlarının ilk 2 sütununu döndürür

   var1  var2
0    29    14
1     3    28
2    22    16

In [ ]:
df[df.var1 >15] 
#var1 sütunundaki değerleri 15'ten büyük olan satırları döndürür

   var1  var2  var3
0    29    14    17
2    22    16     3
3    28     2    27
4    21    19     2
7    23    26    17
9    23    18    17

In [ ]:
df[df.var1 % 2 == 0] 
#var1 sütunundaki değerleri 2'ye tam bölünebilen satırları döndürür

   var1  var2  var3
2    22    16     3
3    28     2    27
5     4    24    26
6    12    29    18

In [106]:
df.loc[(df.var1 > 15) & (df.var2 < 15), "var2"] 
#var1 sütunundaki değerleri 15'ten büyük ve var2 sütunundaki değerleri 20'den küçük olan satırları döndürür

0    14
3     2
Name: var2, dtype: int32

In [109]:
df.query("var1 > 15 & var3 < 15")
# DataFrame'de var1 sütunundaki değerleri 15'ten büyük ve var3 sütunundaki değerleri 20'den küçük olan satırları döndürür

   var1  var2  var3
2    22    16     3
4    21    19     2

In [111]:
df2 = df + 99
df2

   var1  var2  var3
0   128   113   116
1   102   127   118
2   121   115   102
3   127   101   126
4   120   118   101
5   103   123   125
6   111   128   117
7   122   125   116
8   106   107   107
9   122   117   116

In [ ]:
pd.concat([df, df2])
# DataFrame'leri birleştirir, df ve df2'yi yan yana ekler

   var1  var2  var3
0    29    14    17
1     3    28    19
2    22    16     3
3    28     2    27
4    21    19     2
5     4    24    26
6    12    29    18
7    23    26    17
8     7     8     8
9    23    18    17
0   128   113   116
1   102   127   118
2   121   115   102
3   127   101   126
4   120   118   101
5   103   123   125
6   111   128   117
7   122   125   116
8   106   107   107
9   122   117   116

In [113]:
pd.concat([df, df2], ignore_index=True)
# DataFrame'leri birleştirir ve index değerlerini sıfırlar

    var1  var2  var3
0     29    14    17
1      3    28    19
2     22    16     3
3     28     2    27
4     21    19     2
5      4    24    26
6     12    29    18
7     23    26    17
8      7     8     8
9     23    18    17
10   128   113   116
11   102   127   118
12   121   115   102
13   127   101   126
14   120   118   101
15   103   123   125
16   111   128   117
17   122   125   116
18   106   107   107
19   122   117   116

In [116]:
df2.columns = ["var1", "var2", "var3"] 
pd.concat([df,df2], join="inner")
# DataFrame'leri birleştirir ve ortak sütunları alır

   var1  var2  var3
0    29    14    17
1     3    28    19
2    22    16     3
3    28     2    27
4    21    19     2
5     4    24    26
6    12    29    18
7    23    26    17
8     7     8     8
9    23    18    17
0   128   113   116
1   102   127   118
2   121   115   102
3   127   101   126
4   120   118   101
5   103   123   125
6   111   128   117
7   122   125   116
8   106   107   107
9   122   117   116

In [4]:
import pandas as pd
df1 = pd.DataFrame({"Çalışanlar": ["Ali", "Ayşe", "Mehmet", "Fatma"],
                   "Grup": ["Koordinatör","Full Time Çalışan","Eğitim Koordinatörü","İş Geliştirme"]})
df1

  Çalışanlar                 Grup
0        Ali          Koordinatör
1       Ayşe    Full Time Çalışan
2     Mehmet  Eğitim Koordinatörü
3      Fatma        İş Geliştirme

In [5]:
df2 = pd.DataFrame({"Çalışanlar": ["Ali", "Ayşe", "Mehmet", "Fatma"],
                    "İlk Giriş Yılları": [2021, 2019, 2022, 2018]})
df2

  Çalışanlar  İlk Giriş Yılları
0        Ali               2021
1       Ayşe               2019
2     Mehmet               2022
3      Fatma               2018

In [6]:
pd.merge(df1, df2) 
# DataFrame'leri "Çalışanlar" sütununa göre birleştirir

  Çalışanlar                 Grup  İlk Giriş Yılları
0        Ali          Koordinatör               2021
1       Ayşe    Full Time Çalışan               2019
2     Mehmet  Eğitim Koordinatörü               2022
3      Fatma        İş Geliştirme               2018

In [7]:
pd.merge(df1, df2, on="Çalışanlar")
# DataFrame'leri "Çalışanlar" sütununa göre birleştirir ve ortak sütunları alır

  Çalışanlar                 Grup  İlk Giriş Yılları
0        Ali          Koordinatör               2021
1       Ayşe    Full Time Çalışan               2019
2     Mehmet  Eğitim Koordinatörü               2022
3      Fatma        İş Geliştirme               2018

In [9]:
!pip install seaborn
# seaborn kütüphanesini yükler

Requirement already satisfied: seaborn in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (0.13.2)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from seaborn) (2.3.2)
Requirement already satisfied: pandas>=1.2 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from seaborn) (2.3.1)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from seaborn) (3.10.5)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.3.3)
Requirement already satisfied: cycler>=0.10 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.59.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.8)
Requirement already satisfied: packaging>=20.0 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (24.2)
Requirement already satisfied: pillow>=8 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (11.3.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.2.3)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.17.0)

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [10]:
import seaborn as sns # seaborn kütüphanesini içe aktarır
df = sns.load_dataset("planets") # seaborn kütüphanesinden planets veri setini yükler
df.head()

Matplotlib is building the font cache; this may take a moment.

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [11]:
df.shape # DataFrame'in boyutlarını döndürür

(1035, 6)

In [12]:
df.count() # DataFrame'deki her sütunun kaç tane değer içerdiğini döndürür

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [16]:
df["mass"].mean() # mass sütununun ortalamasını döndürür

np.float64(2.6381605847953216)

In [17]:
df["mass"].count() # mass sütunundaki değerlerin sayısını döndürür

np.int64(513)

In [18]:
df["mass"].min() # mass sütununun minimum değerini döndürür

np.float64(0.0036)

In [19]:
df["mass"].max() # mass sütununun maksimum değerini döndürür

np.float64(25.0)

In [20]:
df["mass"].sum() # mass sütununun toplamını döndürür

np.float64(1353.37638)

In [21]:
df["mass"].std() # mass sütununun standart sapmasını döndürür

np.float64(3.8186166509616046)

In [22]:
df["mass"].var() # mass sütununun varyansını döndürür

np.float64(14.58183312700122)

In [23]:
df.describe() # DataFrame'in istatistiksel özetini döndürür

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [28]:
df.describe().T # DataFrame'in istatistiksel özetini transpoze eder

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [27]:
df.dropna().describe().T # NaN değerleri içermeyen DataFrame'in istatistiksel özetini transpoze eder

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [ ]:
df = pd.DataFrame({"Gruplar": ["A", "B", "C", "A", "B", "C"],
                   "Veri": [10, 11, 52, 53, 43, 55]})
df

  Gruplar  Veri
0       A    10
1       B    11
2       C    52
3       A    53
4       B    43
5       C    55

In [30]:
df.groupby("Gruplar").mean() # Gruplara göre ortalama değerleri hesaplar

         Veri
Gruplar
A        31.5
B        27.0
C        53.5

In [32]:
df.groupby("Gruplar").sum() # Gruplara göre ortalama değerleri hesaplar

         Veri
Gruplar
A          63
B          54
C         107

In [34]:
df = sns.load_dataset("planets") # planets veri setini yükler
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [35]:
df.groupby("method")["orbital_period"].mean() 
# method sütununa göre orbital_period sütununun ortalamasını hesaplar

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [38]:
df.groupby("method")["year"].describe()
# method sütununa göre year sütununun istatistiksel özetini döndürür

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [41]:
df = pd.DataFrame({
    "Gruplar": ["A", "B", "C", "A", "B", "C"],
    "Değişken1": [10, 11, 33, 22, 11, 99],
    "Değişken2": [100, 252, 333, 262, 111, 969]})
df

  Gruplar  Değişken1  Değişken2
0       A         10        100
1       B         11        252
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [55]:
import numpy as np
df.groupby("Gruplar").aggregate(["min",np.median ,"max"])

C:\Users\user\AppData\Local\Temp\ipykernel_1560\4258703985.py:2: FutureWarning: The provided callable <function median at 0x000001CBB2B36AC0> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby("Gruplar").aggregate(["min",np.median ,"max"])

        Değişken1            Değişken2
              min median max       min median  max
Gruplar
A              10   16.0  22       100  181.0  262
B              11   11.0  11       111  181.5  252
C              33   66.0  99       333  651.0  969